PacketChat/micropython/ports/esp32/boards/PACKETCHATMESH/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "PacketChatMesh"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "PacketChatMesh"

#define MICROPY_HW_I2C0_SCL                 (42)
#define MICROPY_HW_I2C0_SDA                 (41)

#define MICROPY_HW_SPI1_MOSI                (10)
#define MICROPY_HW_SPI1_MISO                (11)
#define MICROPY_HW_SPI1_SCK                 (9)
#define MICROPY_HW_ENABLE_UART_REPL         (1)
